<a href="https://colab.research.google.com/github/Kate-Strydom/cse450/blob/main/notebooks/hint_scaling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Just creating a fake DataFrame to experiment with
data = pd.DataFrame({'age': [22, 32, 23, 38, 32, 55, 40], 'salary': [120000, 100000, 80000, 45000, 90000, 75000, 55000]})
data

   age  salary
0   22  120000
1   32  100000
2   23   80000
3   38   45000
4   32   90000
5   55   75000
6   40   55000

In [ ]:
# If we need to do some kind of distance-based algorithm with these columns, it would
# help to transform them to the same scale first.
#
# Min-max scaling will make the values span the range 0.0 - 1.0
#
# We could write a function for this and apply() it, but SciKit-Learn has 
# a built in way to do this for us:
from sklearn.preprocessing import MinMaxScaler

# Create an instance of the transform object we're going to use
scaler = MinMaxScaler()

data['age_scaled'] = scaler.fit_transform(data[ ['age'] ])
data['salary_scaled'] = scaler.fit_transform(data[ ['salary'] ])
data

   age  salary  age_scaled  salary_scaled
0   22  120000    0.000000       1.000000
1   32  100000    0.303030       0.733333
2   23   80000    0.030303       0.466667
3   38   45000    0.484848       0.000000
4   32   90000    0.303030       0.600000
5   55   75000    1.000000       0.400000
6   40   55000    0.545455       0.133333